# BuiltInFailures.RebarCouplerFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures Class
BuiltInFailures Class Members See Also
---
Failures concerning couplers
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RebarCouplerFailures
```

Visual Basic
---
```text
Public NotInheritable Class RebarCouplerFailures
```

Visual C++
---
```text
public ref class RebarCouplerFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RebarCouplerFailures
# See Also
BuiltInFailures..::..RebarCouplerFailures Members
Autodesk.Revit.DB Namespace